{"meta":{"title":"Dr Custom","subtitle":"Make your world customized","description":"we are making the world customized with diamond painting, plaques and boxes for home decoration, gifts and more.","author":"Dr Custom","url":"https://dr-custom.com","root":"/"},"pages":[{"title":"","date":"2023-08-02T14:26:13.817Z","updated":"2023-08-02T14:26:13.817Z","comments":true,"path":"Custom-Bag/index.html","permalink":"https://dr-custom.com/Custom-Bag/index.html","excerpt":"","text":"Custom Diamond Painting Kit - Personalized 5D DIY Diamond Art for Adults/Kids Buy directly on Amazon.com Custom Diamond Painting Kit - Personalized 5D DIY Diamond Art for Adults/Kids Buy directly on Amazon.com Custom Diamond Painting Kit - Personalized 5D DIY Diamond Art for Adults/Kids Buy directly on Amazon.com"},{"title":"","date":"2023-08-02T14:28:52.933Z","updated":"2023-08-02T14:28:52.933Z","comments":true,"path":"Night-Light-Custom/index.html","permalink":"https://dr-custom.com/Night-Light-Custom/index.html","excerpt":"","text":"Custom Diamond Painting Kit - Personalized 5D DIY Diamond Art for Adults/Kids Buy directly on Amazon.com"},{"title":"","date":"2023-08-02T14:26:13.817Z","updated":"2023-08-02T14:26:13.817Z","comments":true,"path":"diamond painting/index.html","permalink":"https://dr-custom.com/diamond%20painting/index.html","excerpt":"","text":"Custom Diamond Painting Kit - Personalized 5D DIY Diamond Art for Adults/Kids Buy directly on Amazon.com Custom Diamond Painting Kit - Personalized 5D DIY Diamond Art for Adults/Kids Buy directly on Amazon.com Custom Diamond Painting Kit - Personalized 5D DIY Diamond Art for Adults/Kids Buy directly on Amazon.com"},{"title":"Make your world customized","date":"2021-01-12T08:33:48.000Z","updated":"2023-08-03T09:22:56.374Z","comments":true,"path":"about/index.html","permalink":"https://dr-custom.com/about/index.html","excerpt":"","text":"We are passionate about bringing more fun and surprise to lifeWe believe that everyone deserves to have a little bit of sparkle in their life, and that’s why we offer personalized diamond painting and personalized night light. Our products are made with love and care, and we hope that they bring you joy. How I started this businessWhen I started this business, it was all for a occasstion . Now I love the idea of creating something unique and special for people, and I want to share my love of art with the world. I never expected that people would love my products as much as they do, and I am so grateful for the opportunity to make a difference in people’s lives. I am excited to continue growing my businessI am excited to continue growing my business and to see how it evolves in the future. I believe that there is a lot of potential for personalized diamond painting and personalized night light, and I am committed to making my products the best that they can be."},{"title":"","date":"2023-08-02T14:26:13.817Z","updated":"2023-08-02T14:26:13.817Z","comments":true,"path":"spotify-plaque/index.html","permalink":"https://dr-custom.com/spotify-plaque/index.html","excerpt":"","text":"Custom Diamond Painting Kit - Personalized 5D DIY Diamond Art for Adults/Kids Buy directly on Amazon.com Custom Diamond Painting Kit - Personalized 5D DIY Diamond Art for Adults/Kids Buy directly on Amazon.com Custom Diamond Painting Kit - Personalized 5D DIY Diamond Art for Adults/Kids Buy directly on Amazon.com"},{"title":"Hello","date":"2017-09-11T21:08:18.000Z","updated":"2023-07-11T22:00:30.125Z","comments":true,"path":"welcome/index.html","permalink":"https://dr-custom.com/welcome/index.html","excerpt":"","text":"Thanks for being here!We’re passionate about creating unique and enchanting pieces to enhance your home decor. Whether you’re a diamond painting enthusiast, a fan of mesmerizing night lights, or someone who loves adding a touch of charm with miniature furniture, you’ve come to the right place. Our blog is dedicated to inspiring and delighting visitors like you. Here, you’ll find a treasure trove of articles, tutorials, and ideas to fuel your creativity and help you transform your living space into a magical haven. TOP OFFERING Diamond painting with your grandparents Diamond painting with your lovely dogsDiscover the Art of Diamond PaintingJoin us on a journey into the world of diamond painting, where we showcase stunning designs, share expert tips, and guide you through the process of creating your own dazzling masterpiece. Unleash your inner artist and let the sparkle of diamonds bring your imagination to life. Illuminate Your Nights Spotify plaques for couplesExplore our collection of captivating night lights that cast a gentle glow and create an ambiance of warmth and tranquility. We’ll share insights into the latest night light designs, creative ways to incorporate them into your home, and tips on selecting the perfect one for every room. Miniature MarvelsIndulge in the whimsical world of miniature furniture and decorations. Our blog uncovers the charm of tiny furnishings, from intricate dollhouse items to adorable miniatures that add character to any space. Get inspired as we showcase unique designs and offer styling ideas for creating captivating vignettes. Stay Inspired and InformedBe the first to know about our new arrivals, exclusive promotions, and special events. Our blog keeps you updated on the latest trends, industry news, and helpful DIY projects that will spark your imagination and enhance your creative skills. Join Our CommunityWe believe in fostering a community of like-minded individuals who share a passion for beautiful decor and artistic expression. Connect with fellow enthusiasts, exchange ideas, and showcase your own creations in our friendly and supportive community. Start Your Decorative Journey TodayStep into a world of creativity, beauty, and inspiration. Explore our blog and let your imagination soar. Whether you’re seeking ideas, guidance, or simply a delightful read, we’re here to accompany you on your decorative journey. Welcome to our blog! Let the magic unfold."}],"posts":[{"title":"How do I start custom diamond painting and more","slug":"blog","date":"2023-07-11T21:08:18.000Z","updated":"2023-07-12T10:08:00.315Z","comments":true,"path":"2023/07/11/blog/","link":"","permalink":"https://dr-custom.com/2023/07/11/blog/","excerpt":"","text":"BegainingI used to be an Amazon seller, and to be honest, I didn’t know much about the products or customers. I was just looking to make some extra money. But my world came crashing down in 2022 when the pandemic hit, and my store was shut down due to shipping delays. I was broke, and I didn’t have many options. New pathI started making low-cost products, just to get back on my feet paying my debt. That’s when I stumbled upon the idea of custom products, specifically diamond paintings. I didn’t know much about them, but I knew they could make me some money. The pressure was on, and I was working crazyly to build my new business, but I didn’t feel like I was making a difference. Turning pointThat all changed when one of my customers sent me a thank-you letter. She said spent two days making a diamond painting for her grandmother and her grandmother loved it. And she had seen my coupon but it was offline that time, she hoped to have it to afford to buy another one. I didn’t know if it was true or not, but I decided to give an extra coupon anyway.Few weeks she even sent me a photo of her grandmother, the grey hairs looked very bad but I could feel her happiness, I know she is old. Seeing that photo, I felt a rush of emotions. I thought of my own grandmother, who I ignored always. I realized that I am selling personalized products wasn’t just about making money; it was about making a difference in people’s lives. That’s why I started this blog. I want to remind everyone that love is precious. It’s hard to say, diamond painting is a best choice for gifts, but the time you will spend on it express the valueless to the meaning beyond it’s self.","categories":[],"tags":[]},{"title":"Thanks for being here!","slug":"thanks for being here","date":"2022-09-11T21:08:18.000Z","updated":"2023-07-12T09:53:25.224Z","comments":true,"path":"2022/09/11/thanks for being here/","link":"","permalink":"https://dr-custom.com/2022/09/11/thanks%20for%20being%20here/","excerpt":"","text":"We’re passionate about creating unique and enchanting pieces to enhance your home decor. Whether you’re a diamond painting enthusiast, a fan of mesmerizing night lights, or someone who loves adding a touch of charm with miniature furniture, you’ve come to the right place. Our blog is dedicated to inspiring and delighting visitors like you. Here, you’ll find a treasure trove of articles, tutorials, and ideas to fuel your creativity and help you transform your living space into a magical haven. TOP OFFERING Diamond painting with your grandparents Diamond painting with your lovely dogsDiscover the Art of Diamond PaintingJoin us on a journey into the world of diamond painting, where we showcase stunning designs, share expert tips, and guide you through the process of creating your own dazzling masterpiece. Unleash your inner artist and let the sparkle of diamonds bring your imagination to life. Illuminate Your Nights Spotify plaques for couplesExplore our collection of captivating night lights that cast a gentle glow and create an ambiance of warmth and tranquility. We’ll share insights into the latest night light designs, creative ways to incorporate them into your home, and tips on selecting the perfect one for every room. Miniature MarvelsIndulge in the whimsical world of miniature furniture and decorations. Our blog uncovers the charm of tiny furnishings, from intricate dollhouse items to adorable miniatures that add character to any space. Get inspired as we showcase unique designs and offer styling ideas for creating captivating vignettes. Stay Inspired and InformedBe the first to know about our new arrivals, exclusive promotions, and special events. Our blog keeps you updated on the latest trends, industry news, and helpful DIY projects that will spark your imagination and enhance your creative skills. Join Our CommunityWe believe in fostering a community of like-minded individuals who share a passion for beautiful decor and artistic expression. Connect with fellow enthusiasts, exchange ideas, and showcase your own creations in our friendly and supportive community. Start Your Decorative Journey TodayStep into a world of creativity, beauty, and inspiration. Explore our blog and let your imagination soar. Whether you’re seeking ideas, guidance, or simply a delightful read, we’re here to accompany you on your decorative journey. Welcome to our blog! Let the magic unfold.","categories":[],"tags":[]},{"title":"Famliy series of diamond painting","slug":"Famliy series of diamond painting","date":"2021-07-08T21:08:18.000Z","updated":"2023-07-12T09:52:24.139Z","comments":true,"path":"2021/07/08/Famliy series of diamond painting/","link":"","permalink":"https://dr-custom.com/2021/07/08/Famliy%20series%20of%20diamond%20painting/","excerpt":"","text":"Personalize Your Diamond Painting: Adding a Touch of Individuality to Your MasterpieceDiamond painting is not only a creative and therapeutic activity but also an opportunity to make your artwork truly unique and personal. With personalized diamond painting, you can transform cherished memories, beloved photographs, or even your own designs into dazzling mosaic masterpieces that hold deep sentimental value. Let’s explore how you can add a touch of individuality to your diamond paintings. Choose Meaningful Photos or DesignsStart by selecting photos or designs that hold special significance to you. It could be a precious family portrait, a breathtaking landscape from a memorable trip, a beloved pet, or even a piece of artwork you’ve created yourself. By choosing something meaningful, you’ll infuse your diamond painting with personal significance and create a truly one-of-a-kind piece of art. Just Visit Our Offer on AmazonCustom Design ServicesIf you have a specific vision in mind or need assistance in turning your ideas into a diamond painting, consider utilizing custom design services. Many diamond painting suppliers offer this service, allowing you to submit your own designs or collaborate with their artists to create a personalized diamond painting pattern. From custom portraits to personalized patterns, these services can bring your imagination to life and ensure your diamond painting is a reflection of your unique style. Selecting Colors and Diamond PlacementOne way to personalize your diamond painting is by selecting colors that resonate with you or complement your chosen design. You can experiment with different color schemes or even add extra shades to enhance certain elements and make your artwork stand out. Additionally, you can personalize the placement of diamonds by adding small details, such as initials, dates, or symbols, that hold personal significance within the overall design. Add Text or QuotesAnother way to make your diamond painting truly personal is by incorporating text or meaningful quotes. Consider adding names, dates, special messages, or inspirational quotes that hold significance to you or the intended recipient of the artwork. This adds an extra layer of personalization and makes your diamond painting a heartfelt gift or a beautiful keepsake to treasure. Signature TouchesDon’t forget to add your own signature touches to your diamond paintings. Whether it’s a hidden symbol, a specific arrangement of diamonds, or a unique technique, these personal elements can make your artwork distinctly yours. Infusing your own creativity and style into the process will ensure that your diamond painting reflects your individuality. Share and Celebrate Your Personalized MasterpiecesOnce your personalized diamond painting is complete, proudly display it in your home or share it with loved ones. Your artwork holds not only the beauty of the diamonds but also the depth of your personal connection to the design. Celebrate your masterpiece and the memories it represents, and inspire others to explore the world of personalized diamond painting. Personalizing your diamond painting allows you to create something that is more than just a beautiful artwork; it becomes a symbol of your own story, emotions, and memories. So, dive into the world of diamond painting and let your creativity shine through!","categories":[],"tags":[]}],"categories":[],"tags":[]}